{
  "head.name": "Oleh Prymachenko",
  "head.position": "Front-end Developer",

  "eng": "eng",
  "ukr": "ukr",
  "rus": "rus",

  "favorites": "Your favorite section",
  "like": " You like my {prefer}",
  "score": "with {maxPoints} clicks",

  "about": "about",
  "about.title": "About me",
  "about.body": "I am an active person with a constant need to learn something new. I have an experience working as part of a team under pressure and under tight deadlines. I am really get charge out of coding, thats why I've chosed  development. Moreover coding inspire me, as well as ,conversations and creation at all. I am looking  forward to join the team.",

  "experience": "experience",
  "experience.title": "Work experience",
  "experience.work-1": "Installer decorator",
  "experience.p-1": "was part of creating and installation decor for different kinds of events, like  concerts, exhibitions and etc. I had an experience of business trips abroad, as a participant in international exhibitions. During these projects I have come to the conclusion that great design takes a lot of time and many variations must be tried out in order to reach perfection.",
  "experience.work-2": "Sales Manager",
  "experience.p-2": "During this work, I have developed  communication skills. How to interact with people in long-term negotiations.",
  "experience.date-2": "March 2019 - August 2019",
  "experience.work-3": "Frontend developer",
  "experience.p-3": "Provided services to individuals. Made small tasks on the website for internal needs in the company.",
  "experience.date-3": "December 2020",

  "education": "education",
  "education.title": "Education",
  "education.body-title": "Kiev National University of Trade and Economics",
  "education.body-1": "Department of International Trade and Law",
  "education.body-2": "Bachelor management of external economic activities",
  "education.date": "September 2016 - June 2020 ",

  "skills": "skills",
  "skills.title": "Skills",
  "skills.program-lang-title": "Programming languages",
  "skills.technologies-title": "Technologies",
  "skills.lang-title": "Languages",
  "skills.lang-body": "English (upper-intermediate)",

  "projects": "projects",
  "projects.title": "Projects",
  "projects.project-1-title": "Coffee Shop Website (front-end project)",
  "projects.project-1-p": "Cross-browser website with adaptive layout for different divices where I use basic CSS , HTML, and JS technologies,  as well as CSS animations and  some Bootstrap4 features.",
  "projects.project-2-title": "Stopwatch",
  "projects.project-2-p": "For this pet project I used  React.js with functional approach using RxJS library to understand Reactive programming.",
  "projects.project-3-title": "Quiz",
  "projects.project-3-p": "For this pet project I used JavaScript language with React.js + Redux. This project work with free API to set quiz questions about programming. The goal was to work with React-Redux, use the last best-practices with this banch.",
  "projects.project-4-title": "Client table",
  "projects.project-4-p": "Application that allows to view and edit the list of clients. It  consist of a table, modal edit dialog, and add button. i used tailwindcss framework to style the app, react-query hooks to  fetch/cache application data. To communicate with the server I used graphql-requests and to validate forms  react-hook-form."
}
