{
  "head.name": "Примаченко Олег",
  "head.position": "Front-end разработчик",

  "eng": "eng",
  "ukr": "ukr",
  "rus": "rus",

  "favorites": "Ваш любимый раздел",
  "like": "Вы предпочитаете {prefer}",
  "score": "с {maxPoints} кликами",

  "about": "про меня",
  "about.title": "Про себя",
  "about.body": "Я активный человек с постоянной потребностью узнавать что-то новое. У меня есть опыт работы в команде под давлением и в сжатые сроки. Я действительно получаю удовольствие от програмирования, поэтому я выбрал разработку. Более того, программирование вдохновляет меня, так же как  разговоры и созидание. Я с нетерпением жду возможности присоединиться к команде.",

  "experience": "опыт",
  "experience.title": "Рабочий опыт",
  "experience.work-1": "Установщик-декоратор",
  "experience.p-1": "участвовал в создании и инсталляции декора для различных мероприятий, таких как концерты, выставки и т. д. У меня был опыт заграничных командировок, как участника международных выставок. В ходе этих проектов я пришел к выводу, что отличный дизайн требует много времени и нужно опробовать множество вариаций, чтобы достичь совершенства.",
  "experience.work-2": "Менеджер по продажам",
  "experience.p-2": "За время этой работы у меня развились коммуникативные навыки. Как взаимодействовать с людьми на длительных переговорах.",
  "experience.date-2": "Март 2019 - август 2019",
  "experience.work-3": "Frontend разработчик",
  "experience.p-3": "Оказывал услуги физическим лицам. Сделал небольшие задания на сайте для внутренних нужд компании.",
  "experience.date-3": "Декабрь 2020 г.",

  "education": "образование",
  "education.title": "Образование",
  "education.body-title": "Киевский национальный торгово-экономический университет",
  "education.body-1": "Факультет международной торговли и права",
  "education.body-2": "Бакалавр управления внешнеэкономической деятельностью",
  "education.date": "Сентябрь 2016 - июнь 2020",

  "skills": "навыки",
  "skills.title": "Навыки",
  "skills.program-lang-title": "Языки программирования",
  "skills.technologies-title": "Технологии",
  "skills.lang-title": "Языки",
  "skills.lang-body": "Английский (выше среднего)",

  "projects": "проекты",
  "projects.title": "Проекты",
  "projects.project-1-title": "Сайт магазина кофе (статический веб-сайт)",
  "projects.project-1-p": "Кроссбраузерный веб-сайт с адаптивной версткой для разных устройств, где я использую базовые технологии CSS, HTML и JS, а также анимацию CSS и некоторые функции Bootstrap 4.",
  "projects.project-2-title": "Секундомер",
  "projects.project-2-p": "Для этого любимого проекта я использовал React.js с функциональным подходом с использованием библиотеки RxJS, чтобы попрактиковать реактивное программирование.",
  "projects.project-3-title": "Викторина",
  "projects.project-3-p": "В этом домашнем проекте я использовал язык JavaScript с React.js + Redux. Этот проект работает с бесплатным API, чтобы задавать вопросы викторины по программированию. Целью было работать с React-Redux, использовать последние лучшие практики с этой связкой.",
  "projects.project-4-title": "Клиентская таблица",
  "projects.project-4-p": "Приложение, позволяющее просматривать и редактировать список клиентов. Он состоит из таблицы, модального диалогового окна редактирования и кнопки добавления. Я использовал фреймворк tailwindcss для стилизации приложения, react -query  для извлечения / кеширования данных приложения. Для связи с сервером я использовал graphql-запросы и для проверки формы react -hook-form."
}
