{
  "head.name": "Примаченко Олег",
  "head.position": "Front-end розробник",

  "eng": "анг",
  "ukr": "укр",
  "rus": "рос",

  "favorites": "Ваш улюблений розділ",
  "like": "Ви надаєте перевагу {prefer}",
  "score": "з {maxPoints} кліками ",

  "about": "про мене",
  "about.title": "Про себе",
  "about.body": "Я активна людина з постійною потребою пізнавати щось нове. Я маю досвід роботи у складі команди під тиском і в стислі строки. Я дійсно отримую заряд від кодування, ось чому я вибрав розробку. Більше того, програмування мене надихає, а також розмови та творення взагалі. Я з нетерпінням чекаю приєднання до команди.",

  "experience": "досвід",
  "experience.title": "Робочий досвід",
  "experience.work-1": "Інсталятор-декоратор",
  "experience.p-1": "був частиною створення та інсталяції декору для різних видів подій, таких як концерти, виставки тощо. Я мав досвід ділових поїздок за кордон, як учасник міжнародних виставок. Під час цих проектів я прийшов до висновку, що чудовий дизайн займає багато часу, і багато варіацій потрібно випробувати, щоб досягти досконалості.",
  "experience.work-2": "Менеджер з продажу",
  "experience.p-2": "Під час цієї роботи я сформував навички спілкування. Як взаємодіяти з людьми в довгострокових термінах.",
  "experience.date-2": "Березень 2019 - Серпень 2019",
  "experience.work-3": "Розробник інтерфейсу",
  "experience.p-3": "Надавав послуги приватним особам. Виконав невеликі завдання на веб-сайті для внутрішніх потреб у компанії.",
  "experience.date-3": "Грудень 2020 р",

  "education": "освіта",
  "education.title": "Освіта",
  "education.body": "Київський національний торговельно-економічний університет",
  "education.body-1": "Факультет міжнародної торгівлі та права",
  "education.body-2": "Бакалаврський менеджмент зовнішньоекономічної діяльності",
  "education.date": "Вересень 2016 - червень 2020",

  "skills": "навички",
  "skills.title": "Навички",
  "skills.program-lang-title": "Мови програмування",
  "skills.technologies-title": "Технології",
  "skills.lang-title": "Мови",
  "skills.lang-body": "Англійська (вище середнього)",

  "projects": "проекти",
  "projects.title": "Проекти",
  "projects.project-1-title": "Веб-сайт магазину кави (статичний веб-сайт)",
  "projects.project-1-p": "Крос-браузерний веб-сайт з адаптивним макетом для різних пристроїв, де я використовую базові технології CSS, HTML та JS, а також анімацію CSS та деякі функції Bootstrap 4.",
  "projects.project-2-title": "Секундомір",
  "projects.project-2-p": "Для цього домашнього проекту я використовував React.js з функціональним підходом, використовуючи бібліотеку RxJS для розуміння реактивного програмування.",
  "projects.project-3-title": "Вікторина",
  "projects.project-3-p": "Для цього проекту для домашніх тварин я використовував мову JavaScript разом з React.js + Redux. Цей проект працює з безкоштовним API, щоб задати питання вікторини щодо програмування. Метою була робота з React-Redux, використання останніх найкращих практик з цією связкою.",
  "projects.project-4-title": "Клієнтська таблиця",
  "projects.project-4-p": "Додаток, що дозволяє переглядати і редагувати список клієнтів. Він складається з таблиці, модального діалогового вікна редагування і кнопки додавання. Я використовував фреймворк tailwindcss для стилізації додатки, react -query для вилучення / кешування даних програми. Для зв'язку з сервером я використовував graphql-запити і для перевірки форми react -hook-form."
}
